app/Config/Globals.php

SELECT *
FROM `general_settings`
WHERE `id` = 1
---
    public static function setGlobals()
    {
        self::$db = \Config\Database::connect();
        $session = \Config\Services::session();
        //set general settings
        self::$generalSettings = self::$db->table('general_settings')->where('id', 1)->get()->getRow();

SELECT `users`.*, `role_name`, `permissions`, `is_super_admin`, `is_admin`, `is_vendor`, `is_member`
FROM `users`
JOIN `roles_permissions` ON `roles_permissions`.`id` = `users`.`role_id`
WHERE `users`.`id` = 2
---
        self::$settings = self::getSettings(self::$activeLang->id);
        //authentication
        if (!empty($session->get('mds_ses_user_id')) && !empty($session->get('mds_ses_role_id')) && !empty($session->get('mds_ses_pass'))) {
            $user = self::$db->table('users')->join('roles_permissions', 'roles_permissions.id = users.role_id')
                ->where('users.id', clrNum($session->get('mds_ses_user_id')))->select('users.*, role_name, permissions, is_super_admin, is_admin, is_vendor, is_member')->get()->getRow();

SELECT *
FROM `currencies`
ORDER BY `status` DESC, `id`
---
            }
        }
        //set currencies
        $currencies = self::$db->table('currencies')->orderBy('status DESC, id')->get()->getResult();

SELECT *
FROM `settings`
WHERE `lang_id` = '1'
---
    private static function getSettings($langId)
    {
        $key = 'settings_' . $langId;
        $row = getCacheStatic($key);
        if (!empty($row)) {
            return $row;
        }
        $row = self::$db->table('settings')->where('lang_id', $langId)->get()->getRow();

SELECT *
FROM `routes`
---
    private static function getRoutes()
    {
        $key = 'routes';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = self::$db->table('routes')->get()->getResult();

SELECT *
FROM `languages`
WHERE `status` = 1
ORDER BY `language_order`
---
    private static function getLanguages()
    {
        $key = 'languages';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = self::$db->table('languages')->where('status', 1)->orderBy('language_order')->get()->getResult();

SELECT *
FROM `languages`
WHERE `id` = '1'
---
    private static function getLanguage($id)
    {
        $key = 'language_' . $id;
        $row = getCacheStatic($key);
        if (!empty($row)) {
            return $row;
        }
        $row = self::$db->table('languages')->where('id', $id)->get()->getRow();

SELECT *
FROM `language_translations`
WHERE `lang_id` = '1'
---
    private static function getLanguageTranslations($langId)
    {
        $key = 'language_translations_' . $langId;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = self::$db->table('language_translations')->where('lang_id', $langId)->get()->getResult();

SELECT *
FROM `roles_permissions`
---
    private static function getRolesPermissions()
    {
        $key = 'roles_permissions';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = self::$db->table('roles_permissions')->get()->getResult();