app/Controllers/ChatController.php

    public function chat( string $uuid )
    {
        $data['title']          = trans("messages");
        $data['description']    = trans("messages") . ' - ' . $this->baseVars->appName;
        $data['keywords']       = trans("messages") . ',' . $this->baseVars->appName;
        $data['chat']           = $this->chatModel->where('uuid',$uuid)->first();
---
SELECT *
FROM `chat`
WHERE `uuid` = '672f0c7f4298b3.85606506'
 LIMIT 1