app/Models/AuthModel.php

UPDATE `users` SET `last_seen` = '2024-11-28 14:30:31'
WHERE `id` = '1'
---
    public function updateLastSeen()
    {
        if (authCheck()) {
            $this->builder->where('id', user()->id)->update(['last_seen' => date('Y-m-d H:i:s')]);

INSERT INTO `user_login_activities` (`user_id`, `ip_address`, `user_agent`, `created_at`) VALUES (1, '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36', '2024-11-03 18:10:13')
---
    public function addUserLoginActivity()
    {
        if (!empty($this->session->get('mds_ses_user_id')) && !empty($this->session->get('mds_ses_role_id')) && !empty($this->session->get('mds_ses_pass'))) {
            $data = [
                'user_id' => clrNum($this->session->get('mds_ses_user_id')),
                'ip_address' => getIPAddress(),
                'user_agent' => $this->request->getUserAgent()->getAgentString(),
                'created_at' => date('Y-m-d H:i:s')
            ];
            $this->db->table('user_login_activities')->insert($data);