app/Models/CartModel.php

SELECT *
FROM `taxes`
---
    public function getGlobalTaxArray($total, $taxType)
    {
        $taxes = $this->db->table('taxes')->get()->getResult();