app/Models/ChatModel.php

    public function getChats($userId,$limit = null,$offset = 0)
    {
        return $this->builder->select('chat.*,
        user_receiver.username AS receiver_username, user_receiver.first_name AS receiver_first_name, user_receiver.last_name AS receiver_last_name, user_receiver.avatar AS receiver_avatar, user_receiver.role_id AS receiver_role_id,
        user_sender.username AS sender_username, user_sender.first_name AS sender_first_name, user_sender.last_name AS sender_last_name, user_sender.avatar AS sender_avatar, user_sender.role_id AS sender_role_id,
        (SELECT COUNT(chat_messages.id) FROM chat_messages WHERE chat_messages.chat_id = chat.id AND chat_messages.receiver_id = ' . clrNum($userId) . ' AND  is_read = 0) AS num_unread_messages')
            ->join('users AS user_receiver', 'chat.receiver_id = user_receiver.id')
            ->join('users AS user_sender', 'chat.sender_id = user_sender.id')
            ->where('chat.id IN (SELECT DISTINCT chat_messages.chat_id FROM chat_messages WHERE (chat_messages.receiver_id =  ' . clrNum($userId) . ' OR chat_messages.sender_id =  ' . clrNum($userId) . ') AND chat_messages.deleted_user_id !=  ' . clrNum($userId) . ')')
            ->orderBy('num_unread_messages, chat.updated_at', 'DESC')->get($limit,$offset)->getResult();
---
SELECT `chat`.*, `user_receiver`.`username` AS `receiver_username`, `user_receiver`.`first_name` AS `receiver_first_name`, `user_receiver`.`last_name` AS `receiver_last_name`, `user_receiver`.`avatar` AS `receiver_avatar`, `user_receiver`.`role_id` AS `receiver_role_id`, `user_sender`.`username` AS `sender_username`, `user_sender`.`first_name` AS `sender_first_name`, `user_sender`.`last_name` AS `sender_last_name`, `user_sender`.`avatar` AS `sender_avatar`, `user_sender`.`role_id` AS `sender_role_id`, (SELECT COUNT(chat_messages.id) FROM chat_messages WHERE chat_messages.chat_id = chat.id AND chat_messages.receiver_id = 2 AND  is_read = 0) AS num_unread_messages
FROM `chat`
JOIN `users` AS `user_receiver` ON `chat`.`receiver_id` = `user_receiver`.`id`
JOIN `users` AS `user_sender` ON `chat`.`sender_id` = `user_sender`.`id`
WHERE chat.id IN (SELECT DISTINCT chat_messages.chat_id FROM chat_messages WHERE (chat_messages.receiver_id = 2 OR `chat_messages`.`sender_id` = 2) AND `chat_messages`.`deleted_user_id` != 2)
ORDER BY `num_unread_messages` DESC, `chat`.`updated_at` DESC
 LIMIT 50

    public function getUnreadChatsCount($userId)
    {
        return $this->builder->where('chat.id IN (SELECT chat_id FROM chat_messages WHERE receiver_id = ' . clrNum($userId) . ' AND is_read = 0 AND deleted_user_id = 0)')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `chat`
WHERE chat.id IN (SELECT chat_id FROM chat_messages WHERE receiver_id = 2 AND `is_read` =0 AND `deleted_user_id` =0)

    public function getChat($id)
    {
        return $this->builder->where('id', clrNum($id))->get()->getRow();
---
SELECT *
FROM `chat`
WHERE `id` = 2