app/Models/CommonModel.php

    public function getSliderItemsByLang($langId)
    {
        $key = 'slider_' . $langId;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = $this->builderSlider->where('lang_id', clrNum($langId))->orderBy('item_order')->get()->getResult();
---
SELECT *
FROM `slider`
WHERE `lang_id` = 1
ORDER BY `item_order`

    public function getReviewsCountByProductId($productId)
    {
        return $this->builderReviews->join('users', 'users.id = reviews.user_id')->where('reviews.product_id', clrNum($productId))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `reviews`.`product_id` = 2

    public function getProductReviewsByOffset($productId, $perPage, $offset)
    {
        return $this->builderReviews->join('users', 'users.id = reviews.user_id')->join('products', 'products.id = reviews.product_id')->select('reviews.*, users.username AS user_username, users.slug AS user_slug, users.avatar AS user_avatar, users.user_type AS user_type')
            ->where('products.id', clrNum($productId))->orderBy('reviews.created_at DESC')->limit($perPage, $offset)->get()->getResult();
---
SELECT `reviews`.*, `users`.`username` AS `user_username`, `users`.`slug` AS `user_slug`, `users`.`avatar` AS `user_avatar`, `users`.`user_type` AS `user_type`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
JOIN `products` ON `products`.`id` = `reviews`.`product_id`
WHERE `products`.`id` = 2
ORDER BY `reviews`.`created_at` DESC
 LIMIT 10

    public function getProductCommentsByOffset($productId, $perPage, $offset)
    {
        $arrayComments = array();
        $parentIds = array();
        $parentResult = $this->builderComments->join('users', 'comments.user_id = users.id', 'left')
            ->select('comments.*, users.username AS user_username, users.slug AS user_slug, users.avatar AS user_avatar, users.user_type AS user_type')
            ->where('product_id', clrNum($productId))->where('parent_id', 0)->orderBy('id DESC')->limit($perPage, $offset)->get()->getResult();
---
SELECT `comments`.*, `users`.`username` AS `user_username`, `users`.`slug` AS `user_slug`, `users`.`avatar` AS `user_avatar`, `users`.`user_type` AS `user_type`
FROM `comments`
LEFT JOIN `users` ON `comments`.`user_id` = `users`.`id`
WHERE `product_id` = 2
AND `parent_id` = 0
ORDER BY `id` DESC
 LIMIT 10

    public function getProductCommentCount($productId)
    {
        return $this->builderComments->where('product_id', clrNum($productId))->where('parent_id', 0)->where('status', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `product_id` = 2
AND `parent_id` = 0
AND `status` = 1

    public function getBrandsSlider()
    {
        $key = 'brands_slider';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = $this->builderBrands->where('show_on_slider', 1)->orderBy('name')->get()->getResult();
---
SELECT *
FROM `brands`
WHERE `show_on_slider` = 1
ORDER BY `name`