app/Models/FileModel.php

    public function getProductImages($productId)
    {
        return $this->builderImages->where('product_id', clrNum($productId))->orderBy('images.is_main DESC')->get()->getResult();
---
SELECT *
FROM `images`
WHERE `product_id` = 2
ORDER BY `images`.`is_main` DESC

    public function getProductMainImage($productId)
    {
        return $this->builderImages->where('product_id', clrNum($productId))->orderBy('images.is_main DESC')->get()->getRow();
---
SELECT *
FROM `images`
WHERE `product_id` = 2
ORDER BY `images`.`is_main` DESC

    public function getUserFileManagerImages($userId)
    {
        return $this->builderFileManager->where('user_id', clrNum($userId))->orderBy('id DESC')->get()->getResult();
---
SELECT *
FROM `images_file_manager`
WHERE `user_id` = 1
ORDER BY `id` DESC

    public function getProductVideo($productId)
    {
        return $this->builderMedia->where('product_id', clrNum($productId))->where('media_type', 'video')->get()->getRow();
---
SELECT *
FROM `media`
WHERE `product_id` = 2
AND `media_type` = 'video'

    public function getProductAudio($productId)
    {
        return $this->builderMedia->where('product_id', clrNum($productId))->where('media_type', 'audio')->get()->getRow();
---
SELECT *
FROM `media`
WHERE `product_id` = 2
AND `media_type` = 'audio'