app/Models/MembershipModel.php

    public function checkMembershipPlansExpired()
    {
        $plans = $this->builderUsersMembershipPlans->join('users', 'users_membership_plans.user_id = users.id AND users.is_membership_plan_expired = 0')->select('users_membership_plans.*')->get()->getResult();
---
SELECT `users_membership_plans`.*
FROM `users_membership_plans`
JOIN `users` ON `users_membership_plans`.`user_id` = `users`.`id` AND `users`.`is_membership_plan_expired` = 0