app/Models/OrderModel.php

SELECT *
FROM `order_products`
WHERE `buyer_id` = 2
AND `product_id` = 2
---
    public function checkUserBoughtProduct($userId, $productId)
    {
        if (!empty($this->builderOrderProducts->where('buyer_id', clrNum($userId))->where('product_id', clrNum($productId))->get()->getRow())) {

SELECT COUNT(*) AS `numrows`
FROM `refund_requests`
WHERE `seller_id` = 1
AND `status` =0
---
    public function getSellerActiveRefundRequestCount($userId)
    {
        return $this->builderRefundRequests->where('seller_id', clrNum($userId))->where('status = 0')->countAllResults();