app/Models/OrderModel.php

SELECT COUNT(*) AS `numrows`
FROM `refund_requests`
WHERE `seller_id` = 1
AND `status` =0
---
    public function getSellerActiveRefundRequestCount($userId)
    {
        return $this->builderRefundRequests->where('seller_id', clrNum($userId))->where('status = 0')->countAllResults();