app/Models/PageModel.php

SELECT `id`, `title`, `slug`, `page_order`, `location`, `page_default_name`
FROM `pages`
WHERE `lang_id` = 1
AND `visibility` = 1
ORDER BY `page_order`
---
    public function getMenuLinks($langId)
    {
        $key = 'menu_links_' . $langId;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = $this->builder->select('id, title, slug, page_order, location, page_default_name')->where('lang_id', clrNum($langId))->where('visibility', 1)->orderBy('page_order')->get()->getResult();

SELECT *
FROM `pages`
WHERE `slug` = 't-shirt-2'
AND `visibility` = 1
AND `pages`.`lang_id` = '1'
---
    public function getPage($slug)
    {
        return $this->builder->where('slug', strSlug($slug))->where('visibility', 1)->where('pages.lang_id', selectedLangId())->get()->getRow();

SELECT *
FROM `pages`
WHERE `page_default_name` = 'terms_conditions'
AND `visibility` = 1
AND `lang_id` = 1
---
    public function getPageByDefaultName($defaultName, $langId)
    {
        return $this->builder->where('page_default_name', cleanStr($defaultName))->where('visibility', 1)->where('lang_id', clrNum($langId))->get()->getRow();