app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `is_promoted` = 1
---
    public function checkPromotedProducts()
    {
        $products = $this->builder->where('is_promoted', 1)->get()->getResult();

SELECT `products`.*, `users`.`username` as `user_username`, `users`.`role_id` as `user_role`, `users`.`slug` as `user_slug`, (SELECT name_data FROM brands WHERE products.brand_id = brands.id) AS brand_name_data
FROM `products`
JOIN `users` ON `products`.`user_id` = `users`.`id` AND `users`.`banned` = 0
WHERE `users`.`vacation_mode` = 0
AND `products`.`slug` = 't-shirt-2'
AND `products`.`is_draft` = 0
AND `products`.`is_deleted` = 0
AND `users`.`role_id` != 'member'
---
    public function getProductBySlug($slug)
    {
        if ($this->generalSettings->membership_plans_system == 1) {
            $this->builder->join('users', 'products.user_id = users.id AND users.banned = 0 AND users.is_membership_plan_expired = 0');
        } else {
            $this->builder->join('users', 'products.user_id = users.id AND users.banned = 0');
        }
        $this->builder->where('users.vacation_mode', 0);
        $this->builder->select('products.*, users.username as user_username, users.role_id as user_role, users.slug as user_slug,
              (SELECT name_data FROM brands WHERE products.brand_id = brands.id) AS brand_name_data')
            ->where('products.slug', strSlug($slug))->where('products.is_draft', 0)->where('products.is_deleted', 0);

SELECT *
FROM `product_details`
WHERE `product_id` = 2
AND `lang_id` = 1
---
    public function getProductDetails($id, $langId, $getMainOnNull = true)
    {
        $row = $this->builderProductDetails->where('product_id', clrNum($id))->where('lang_id', clrNum($langId))->get()->getRow();

SELECT *
FROM `wishlist`
WHERE `user_id` = '2'
AND `product_id` = 2
---
    public function isProductInWishlist($productId)
    {
        if (authCheck()) {
            if (!empty($this->builderWishlist->where('user_id', user()->id)->where('product_id', clrNum($productId))->get()->getRow())) {

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `product_id` = 2
---
    public function getProductWishlistCount($productId)
    {
        return $this->builderWishlist->where('product_id', clrNum($productId))->countAllResults();

UPDATE `products` SET `pageviews` = 8
WHERE `id` = '2'
---
    public function increaseProductPageviews($product)
    {
        if (!empty($product)) {
            if (empty(helperGetSession('pr_' . $product->id))) {
                helperSetSession('pr_' . $product->id, '1');
                $this->builder->where('id', $product->id)->update(['pageviews' => $product->pageviews + 1]);