app/Models/ProfileModel.php

SELECT *
FROM `shipping_addresses`
WHERE `id` = 9
AND `user_id` = 1
---
    public function getShippingAddressById($addressId, $userId)
    {
        return $this->builderShippingAddresses->where('id', clrNum($addressId))->where('user_id', clrNum($userId))->get()->getRow();

SELECT *
FROM `shipping_addresses`
WHERE `user_id` = 1
---
    public function getShippingAddresses($userId)
    {
        return $this->builderShippingAddresses->where('user_id', clrNum($userId))->get()->getResult();

SELECT *
FROM `shipping_addresses`
WHERE `user_id` = 1
AND `address_type` = 'shipping'
 LIMIT 1
---
    public function getFirstShippingAddress($userId, $addressType)
    {
        return $this->builderShippingAddresses->where('user_id', clrNum($userId))->where('address_type', cleanStr($addressType))->get(1)->getRow();