app/Models/SettingsModel.php

SELECT *
FROM `payment_gateways`
WHERE `name_key` = 'bank_transfer'
---
    public function getPaymentGateway($nameKey)
    {
        return $this->builderPaymentGateways->where('name_key', strSlug($nameKey))->get()->getRow();

SELECT *
FROM `payment_gateways`
WHERE `status` = 1
---
    public function getActivePaymentGateways()
    {
        return $this->builderPaymentGateways->where('status', 1)->get()->getResult();

SELECT *
FROM `fonts`
WHERE id IN (19,22)
---
    public function getSelectedFonts($settings)
    {
        $key = 'fonts_' . $settings->id;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $arrayFonts = array();
        $fonts = $this->builderFonts->whereIn('id', [clrNum($settings->site_font), clrNum($settings->dashboard_font)], false)->get()->getResult();