app/Models/ShippingModel.php

SELECT *
FROM `shipping_zone_locations`
WHERE `state_id` = 977
AND `user_id` = 1
SELECT *
FROM `shipping_zone_locations`
WHERE `country_id` = 72
AND `state_id` = 0
AND `user_id` = 1
---
    public function getCartShippingMethods($sellerId, $stateId)
    {
        $continentCode  = '';
        $countryId       = '';
        //get the state
        $state = getState($stateId);

        if (!empty($state)) {
            //get country
            $country = getCountry($state->country_id);

            if (!empty($country)) {
                $countryId      = $country->id;
                $continentCode  = $country->continent_code;
            }

            //get shipping options by state
            $zoneLocations  = array();
            $zoneIds        = array();

            if (!empty($state->id)) {
                $zoneLocations = $this->builderZoneLocations->where('state_id', clrNum($state->id))->where('user_id', clrNum($sellerId))->get()->getResult();
            }

            //get shipping options by country
            if (empty($zoneLocations) && countItems($zoneLocations) < 1 && !empty($countryId)) {
                $zoneLocations = $this->builderZoneLocations->where('country_id', clrNum($countryId))->where('state_id', 0)->where('user_id', clrNum($sellerId))->get()->getResult();

SELECT *
FROM `shipping_zone_methods`
WHERE zone_id IN (11)
AND `user_id` = 1
AND `status` = 1
ORDER BY FIELD(method_type, 'free_shipping', 'local_pickup', 'flat_rate')
---

            //get shipping methods
            if (!empty($zoneIds)) {
                return $this->builderZoneMethods->whereIn('zone_id', $zoneIds, FALSE)->where('user_id', clrNum($sellerId))->where('status', 1)->orderBy("FIELD(method_type, 'free_shipping', 'local_pickup', 'flat_rate')")->get()->getResult();

SELECT *
FROM `shipping_zone_methods`
WHERE `zone_id` = 11
ORDER BY `id` DESC
---
    public function getShippingPaymentMethodsByZone($zoneId)
    {
        return $this->builderZoneMethods->where('zone_id', clrNum($zoneId))->orderBy('id DESC')->get()->getResult();

SELECT *
FROM `shipping_delivery_times`
WHERE `id` = 0
---
    public function editShippingDeliveryTime($id)
    {
        $row = $this->getShippingDeliveryTime($id);
        if (empty($row) || $row->user_id != user()->id) {
            return false;
        }
        $optionArray = array();
        foreach ($this->activeLanguages as $language) {
            $item = [
                'lang_id' => $language->id,
                'option' => inputPost('option_lang_' . $language->id, true)
            ];
            array_push($optionArray, $item);
        }
        $data = [
            'option_array' => serialize($optionArray)
        ];
        return $this->buildersDeliveryTimes->where('id', $row->id)->update($data);

SELECT *
FROM `shipping_delivery_times`
WHERE `user_id` = 1
ORDER BY `id` DESC
---
    public function getShippingDeliveryTimes($userId, $sort = '')
    {
        $this->buildersDeliveryTimes->where('user_id', clrNum($userId));
        if (!empty($sort)) {
            $this->buildersDeliveryTimes->orderBy('id DESC');
        } else {
            $this->buildersDeliveryTimes->orderBy('id');
        }
        return $this->buildersDeliveryTimes->get()->getResult();

SELECT *
FROM `shipping_delivery_times`
WHERE `id` = 0
---
    public function getShippingDeliveryTime($id)
    {
        return $this->buildersDeliveryTimes->where('id', clrNum($id))->get()->getRow();