app/Models/VariationModel.php

SELECT *
FROM `variations`
WHERE `product_id` = 2
AND `is_visible` = 1 AND (`variation_type` = 'text' OR `variation_type` = 'number' OR `variation_type` = 'dropdown')
ORDER BY `id`
---
    public function getHalfWidthProductVariations($productId)
    {
        return $this->builder->where('product_id', clrNum($productId))->where("is_visible = 1 AND (variation_type = 'text' OR variation_type = 'number' OR variation_type = 'dropdown')")->orderBy('id')->get()->getResult();

SELECT *
FROM `variations`
WHERE `product_id` = 2
AND `is_visible` = 1 AND (`variation_type` = 'checkbox' OR `variation_type` = 'radio_button')
ORDER BY `id`
---
    public function getFullWidthProductVariations($productId)
    {
        return $this->builder->where('product_id', clrNum($productId))->where("is_visible = 1 AND (variation_type = 'checkbox' OR variation_type = 'radio_button')")->orderBy('id')->get()->getResult();